In [1]:
import pandas as pd
import numpy as np

In [2]:
# combining data across rows/columns

In [3]:
# Inner join
# Using dictionary to create a dataframe from pandas

In [18]:
data_dict1={'Name':['Ibrahim Musa','Emeka Jude','Emmanuel Ayomide'],
           'Age':[24,25,27],
           'Sport':['Football','Basketball','Volleyball']}

In [19]:
data_dict2={'Name':['Nnamdi Ike','Emmanuel Ayomide','Ahmed Musa'],
           'Age':[24,27,28],
           'Sport':['Football','Volleyball','Swimming']}

In [20]:
df=pd.DataFrame(data_dict1,index=[0,1,2])

In [21]:
df

               Name  Age       Sport
0      Ibrahim Musa   24    Football
1        Emeka Jude   25  Basketball
2  Emmanuel Ayomide   27  Volleyball

In [14]:
new_df=pd.DataFrame(data_dict2,index=[3,2,5])

In [15]:
new_df

               Name  Age       Sport
3        Nnamdi Ike   24    Football
2  Emmanuel Ayomide   27  Volleyball
5        Ahmed Musa   28    Swimming

In [16]:
# let's concat our variable using concat method

In [22]:
pd.concat([df,new_df])

               Name  Age       Sport
0      Ibrahim Musa   24    Football
1        Emeka Jude   25  Basketball
2  Emmanuel Ayomide   27  Volleyball
3        Nnamdi Ike   24    Football
2  Emmanuel Ayomide   27  Volleyball
5        Ahmed Musa   28    Swimming

In [26]:
pd.concat([df,new_df],axis=1)

               Name   Age       Sport              Name   Age       Sport
0      Ibrahim Musa  24.0    Football               NaN   NaN         NaN
1        Emeka Jude  25.0  Basketball               NaN   NaN         NaN
2  Emmanuel Ayomide  27.0  Volleyball  Emmanuel Ayomide  27.0  Volleyball
3               NaN   NaN         NaN        Nnamdi Ike  24.0    Football
5               NaN   NaN         NaN        Ahmed Musa  28.0    Swimming

In [27]:
# Outer is when you want union between two dataset
pd.concat([df,new_df],axis=1,join='outer')

               Name   Age       Sport              Name   Age       Sport
0      Ibrahim Musa  24.0    Football               NaN   NaN         NaN
1        Emeka Jude  25.0  Basketball               NaN   NaN         NaN
2  Emmanuel Ayomide  27.0  Volleyball  Emmanuel Ayomide  27.0  Volleyball
3               NaN   NaN         NaN        Nnamdi Ike  24.0    Football
5               NaN   NaN         NaN        Ahmed Musa  28.0    Swimming

In [28]:
# Inner is when you want an intersection between two dataset

In [29]:
pd.concat([df,new_df],axis=1,join='inner')

               Name  Age       Sport              Name  Age       Sport
2  Emmanuel Ayomide   27  Volleyball  Emmanuel Ayomide   27  Volleyball

In [30]:
# Group key in concatenating

In [31]:
dff=pd.concat([df,new_df],keys=['x','y'])

In [32]:
dff

                 Name  Age       Sport
x 0      Ibrahim Musa   24    Football
  1        Emeka Jude   25  Basketball
  2  Emmanuel Ayomide   27  Volleyball
y 3        Nnamdi Ike   24    Football
  2  Emmanuel Ayomide   27  Volleyball
  5        Ahmed Musa   28    Swimming

In [35]:
dff.loc['x']

               Name  Age       Sport
0      Ibrahim Musa   24    Football
1        Emeka Jude   25  Basketball
2  Emmanuel Ayomide   27  Volleyball

In [36]:
dff.loc['y']

               Name  Age       Sport
3        Nnamdi Ike   24    Football
2  Emmanuel Ayomide   27  Volleyball
5        Ahmed Musa   28    Swimming

In [37]:
# Merge method for combining rows with common characteristics